In [1]:
df=data.frame(emp_id=c(1,2,3,4,5,6),emp_name=c("Harish","Balaji","Suiya","veeramani","sabari","rohi"),
              emp_date=as.Date(c("2019-09-26","2019-08-23","2019-07-26","2022-09-20","2000-01-01","1990-09-10")),
              gender=factor(c("m","m","f","f","f","f")))

In [2]:
df

  emp_id emp_name  emp_date   gender
1 1      Harish    2019-09-26 m
2 2      Balaji    2019-08-23 m
3 3      Suiya     2019-07-26 f
4 4      veeramani 2022-09-20 f
5 5      sabari    2000-01-01 f
6 6      rohi      1990-09-10 f

In [18]:
# adding new column

df$dept=c('cse','phy','che','eng','tam','math')   #df $ column name
df

  emp_id emp_name  emp_date   gender dept
1 1      Harish    2019-09-26 m      cse
2 2      Balaji    2019-08-23 m      phy
3 3      Suiya     2019-07-26 f      che
4 4      veeramani 2022-09-20 f      eng
5 5      sabari    2000-01-01 f      tam
6 6      rohi      1990-09-10 f      math

In [4]:
# adding new row 
newr=data.frame(emp_id=c(7),emp_name=c("shiva"),emp_date=as.Date(c("2002-09-20")),gender=factor(c("f")),dept=c("java"))

In [5]:
newr

  emp_id emp_name emp_date   gender dept
1 7      shiva    2002-09-20 f      java

In [6]:
rbind(df,newr)    # r bind used to add new new row in data frame

  emp_id emp_name  emp_date   gender dept
1 1      Harish    2019-09-26 m      cse
2 2      Balaji    2019-08-23 m      phy
3 3      Suiya     2019-07-26 f      che
4 4      veeramani 2022-09-20 f      eng
5 5      sabari    2000-01-01 f      tam
6 6      rohi      1990-09-10 f      math
7 7      shiva     2002-09-20 f      java

In [19]:
#removing column or drop columns

df=subset(df,select=-c(dept))  # removing dept column

In [20]:
df

  emp_id emp_name  emp_date   gender
1 1      Harish    2019-09-26 m
2 2      Balaji    2019-08-23 m
3 3      Suiya     2019-07-26 f
4 4      veeramani 2022-09-20 f
5 5      sabari    2000-01-01 f
6 6      rohi      1990-09-10 f

In [6]:
# removing row 
df[-c(2),]

  emp_id emp_name  emp_date   gender
1 1      Harish    2019-09-26 m
3 3      Suiya     2019-07-26 f
4 4      veeramani 2022-09-20 f
5 5      sabari    2000-01-01 f
6 6      rohi      1990-09-10 f

In [10]:
df1=data.frame(StudentId=c(101,102,103,104,105,106),Product=c("Hindi","English","Maths","Science","Political Science","Physics"))
df1

df2=data.frame(StudentId=c(102,104,106,107,108),State=c("Mangalore","Mysore","Pune","Dehradun","Dehli"))
df2

  StudentId Product
1 101       Hindi
2 102       English
3 103       Maths
4 104       Science
5 105       Political Science
6 106       Physics

  StudentId State
1 102       Mangalore
2 104       Mysore
3 106       Pune
4 107       Dehradun
5 108       Dehli

In [11]:
#left join
df=merge(x=df1,y=df2,by="StudentId",all.x=TRUE)
df

#right join
df=merge(x=df1,y=df2,by="StudentId",all.y=TRUE)
df

#natural join
df=merge(x=df1,y=df2,by="StudentId",all=FALSE)  # common values only get printed
df

#full outer join
df=merge(x=df1,y=df2,by="StudentId",all=TRUE)
df

  StudentId Product           State
1 101       Hindi             NA
2 102       English           Mangalore
3 103       Maths             NA
4 104       Science           Mysore
5 105       Political Science NA
6 106       Physics           Pune

  StudentId Product State
1 102       English Mangalore
2 104       Science Mysore
3 106       Physics Pune
4 107       NA      Dehradun
5 108       NA      Dehli

  StudentId Product State
1 102       English Mangalore
2 104       Science Mysore
3 106       Physics Pune

  StudentId Product           State
1 101       Hindi             NA
2 102       English           Mangalore
3 103       Maths             NA
4 104       Science           Mysore
5 105       Political Science NA
6 106       Physics           Pune
7 107       NA                Dehradun
8 108       NA                Dehli

In [7]:
# looping 
# entry check loop,exit check loop
# looping statements break and next
#conditional statemnets

a=as.integer(readline("enter a value "))
if(a%%2==0)
    {
    print("even")
}else
    {
    print("odd")
}

enter a value 12
[1] "even"

In [22]:
l=list(1,2,3,4,5)
for(x in l)
    {
    if(x==4)
        {                                                # next (continue)
        next
    }
    print(x)
}

[1] 1
[1] 2
[1] 3
[1] 5

In [23]:
l=list(1,2,3,4,5)
for(x in l)
    {
    if(x==4)
        {
        break                                                      #break
    }                                                       
    print(x)
}

[1] 1
[1] 2
[1] 3

In [15]:
# for loop

l=list(1,2,3,4,5)
for(x in l)
    {
    
    print(x)
}

[1] 1
[1] 2
[1] 3
[1] 4
[1] 5

In [20]:
# while - amstrong number (153= 1 cube + 5 cube + 3 cube =153)

num=as.numeric(readline("Enter a number:"))
arm=num   # cause at end of loop num will be differ 
sum=0
while(num>0){
    digit=num%%10
    sum=sum+(digit^3)
    num=floor(num/10)
}
paste("The sum of cube of the digits is ",sum)
if(arm==sum){
    paste("It is Armstrong number")
}else{
    paste("It is not a Armstrong number")
}

Enter a number:123

[1] "The sum of cube of the digits is  36"

[1] "It is not a Armstrong number"

In [19]:
# while - sum of digits

num=as.numeric(readline("Enter a number:"))
arm=num
sum=0
while(num>0){
    digit=num%%10
    sum=sum+digit
    num=floor(num/10)
}
paste("The sum  of the digits is ",sum)

Enter a number:123

[1] "The sum  of the digits is  6"

In [3]:
#reverse of number


num=as.numeric(readline("Enter a number:"))
rev=0
rem=0
temp=num
while(num>0){
    digit=num%%10
    rev=rev*10+digit
    num=floor(num/10)
}
paste("The reverse  of the digits is ",rev)

Enter a number:123

[1] "The reverse  of the digits is  321"

In [23]:
#Reverse/palindrome of the Digits
num=as.numeric(readline("Enter a number:"))
rev=0
pal=num
while(num>0){
    digit=num%%10
    rev=rev*10+digit
    num=floor(num/10)
}
paste("The Reverse of the number is ",rev)
if(pal==rev){
    paste("The number is palindrome")
}else{
    paste("The number is not a palindrome")
}

Enter a number:131

[1] "The Reverse of the number is  131"

[1] "The number is palindrome"

In [1]:
1%%10

[1] 1

In [2]:
1/10

[1] 0.1